<!-- dflook/terraform-github-actions {"workspace":"bookworm-base","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"71d0b09c289c0e18110c33fe92d721192d03e315ab665d5233caf64bb8398beb","plan_job_ref":"Job Test actions using target and replace #504 at https://github.com/dflook/terraform-github-actions/actions/runs/15345085174","plan_hash":"5da4a65a82c60aa14728073b1387918ff1635cf6a17cf11bbd04640eb4f0abf3","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __bookworm-base__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "qRsOeGd5FH" -> (known after apply)
!~  foreach = "ob98JGX8YX" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #504](https://github.com/dflook/terraform-github-actions/actions/runs/15345085174)